Revit 2027 API
RebarShapeDrivenAccessor.ComputeDrivingCurves Method
 Compute the driving curves.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<Curve> ComputeDrivingCurves()
Public Function ComputeDrivingCurves As IList(Of Curve)
public:
IList<Curve^>^ ComputeDrivingCurves()
member ComputeDrivingCurves : unit -> IList<Curve>
Return Value
IList<Curve>
 Returns an empty array if an error is encountered.
Exceptions
Exception | Condition
InvalidOperationException |  This RebarShapeDrivenAccessor doesn't contain a valid rebar reference.
Remarks
 The driving curves are the ones that appear in rebar sketch mode. They include lines and arcs that drive the shape, but exclude fillets, hooks and cranks. They always lie in a plane-- if the bar is 3D, these curves are a subset or a projection. They are also used for shape matching.
See Also
Reference
RebarShapeDrivenAccessor Class
Autodesk.Revit.DB.Structure Namespace